Repository: lukaszdaniel/r-svn
Catalog: src/library/grid/po/*.po
Languages: pl

source: updateGContext must only be called after initGContext
pl: updateGContext() musi być wywołany tylko po initGContext()

source: Turning clipping on or off within a (clipping) path is no honoured
pl: Włączanie i wyłączanie przycinania w obrębie ścieżki (przycinania) nie jest honorowane

source: cannot clip to rotated viewport
pl: nie można przyciąć do obróconego okienka ekranu

source: Clipping paths within a (clipping) path are not honoured
pl: Ścieżki przycinające w ścieżce (przycinającej) nie są honorowane

source: Masks within a (clipping) path are not honoured
pl: Maski znajdujące się w ścieżce (przycinającej) nie są honorowane

source: Viewport '%s' was not found
pl: Okno widoku '%s' nie zostało znalezione

source: cannot pop the top-level viewport ('grid' and 'graphics' output mixed?)
pl: nie można wyświetlić okienka ekranu na wierzchu (wyjścia 'grid' oraz 'graphics' pomieszały się?)

source: attempt to plot on null device
pl: próba rysowania na pustym urządzeniu

source: there is no layout defined
pl: nie określono układu

source: polygon edge not found (zero-width or zero-height?)
pl: nie znaleziono krawędzi wielokąta (zerowa szerokość lub zerowa wysokość?)

source: polygon edge not found
pl: nie znaleziono krawędzi wielokąta

source: require at least two points to draw arrow
pl: wymaga co najmniej dwu punktów, aby narysować strzałkę

source: non-finite control point in Xspline
pl: nieskończony punkt kontrolny w 'Xspline'

source: non-finite x or y in graphics path
pl: nieskończony 'x' lub 'y' w ścieżce grafiki

source: Empty raster
pl: Pusty raster

source: use of negative pch with symbol font is invalid
pl: użycie ujemnej wartości 'pch' z symbolem jest niepoprawne

source: Coordinates for text pch not yet supported
pl: Współrzędne dla tekstowych pch nie są jeszcze obsługiwane

source: pch value '%d' is invalid in this locale
pl: wartość pch '%d' nie jest poprawna dla tej lokalizacji

source: unimplemented pch value '%d'
pl: niezaimplementowana wartość 'pch' '%d'

source: invalid plotting symbol
pl: niepoprawny symbol wykresu

source: unable to clip to rotated rectangle
pl: nie można przypiąć do obróconego prostokąta

source: invalid 'layout.pos.row'
pl: niepoprawny 'layout.pos.row'

source: invalid 'layout.pos.col'
pl: niepoprawny 'layout.pos.col'

source: singular transformation matrix
pl: osobliwa macierz transformacyjna

source: unable to store 'grid' state. Too many devices open?
pl: nie można zachować stanu siatki. Zbyt duża liczba otwartych urządzeń?

source: Cannot create unit scalar from 0-length unit vector
pl: Nie można utworzyć jednostkowego skalara z jednostkowego wektora o długości 0

source: invalid unit or unit not yet implemented
pl: niedozwolona jednostka lub jednostka nie została jeszcze zaimplementowana

source: Viewport has zero dimension(s)
pl: Okno ekranu ma zerowe wymiary

source: Unsupported unit conversion
pl: Niewspierana jednostka konwersji

source: Invalid unit
pl: Niepoprawna jednostka

source: 'units' must be character
pl: 'units' muszą być tekstem

source: '%s' must be of length > 0
pl: '%s' muszą mieć długość > 0

source: data must be either NULL, have length 1, or match the length of the final unit vector
pl: dane muszą mieć wartość NULL, mieć długość 1 lub odpowiadać długości końcowego wektora jednostkowego

source: no string supplied for 'strwidth/height' unit
pl: nie podano ciągu znaków dla jednostki 'strwidth/height'

source: no 'grob' supplied for 'grobwidth/height' unit
pl: nie podano 'grob' dla jednostki 'grobwidth/height'

source: 'gPath' must have depth 1 in 'grobwidth/height' units
pl: 'gPath' musi mieć głębokość 1 w jednostkach 'grobwidth/height'

source: non-NULL value supplied for plain unit
pl: wartość różna od NULL podana dla zwykłej jednostki

source: old version of unit class is no longer allowed
pl: stara wersja klasy jednostek nie jest już dozwolona

source: object is not coercible to a unit
pl: obiekt nie jest przekształcalny do jednostki

source: object is not a unit
pl: obiekt nie jest jednostką

source: units can only be multiplied with numerics and integers
pl: jednostki można mnożyć tylko przez liczby i liczby całkowite

source: Unable to calculate text width/height (using zero)
pl: Nie można obliczyć szerokości/wysokości tekstu (używanie zera)

source: grid grob object is empty
pl: obiekt "grob" jest pusty

source: Mask is not logical value ('none' or 'inherit')
pl: Maska nie jest wartością logiczną ('none' lub 'inherit')

source: non-finite location and/or size for viewport
pl: nieskończone położenie oraz/lub rozmiar okna ekranu
