Repository: lukaszdaniel/r-svn
Catalog: src/library/methods/po/*.po
Languages: es, pl

source: calling the C routine used as an initializer for 'externalptr' objects
es: llamando a la rutina C utilizada como inicializador para objetos 'externalptr'
pl: wywołanie procedury C użyte jako inicjator dla obiektów 'externalptr'

source: invalid list for substitution
es: lista no válida para sustitución
pl: niepoprawna lista do podmiany

source: unexpected type '%s' for condition message
es: tipo inesperado '%s' para el mensaje de condición
pl: nieoczekiwany typ '%s' w wiadomości warunkowej

source: condition message must be length 1
es: mensaje de condición debe tener una longitud de 1
pl: wiadomość warunkowa musi być długości 1

source: could not find the skeleton calls for 'methods' (package detached?): expect very bad things to happen
es: no se encuentran las llamadas esqueleto para 'methods' (¿paquete no adjuntado?): cosas muy malas han de suceder
pl: nie można znaleźć głównych wywołań dla 'methods' (odłączony pakiet?): oczekuj pojawienia się bardzo złych rzeczy

source: no "allMethods" slot found in object of class "%s" used as methods list for function '%s'
es: no se encontró ningún slot "allMethods" en el objeto de clase "%s" utilizado como lista de métodos para la función '%s'
pl: nie znaleziono gniazda 'allMethods' w obiekcie klasy "%s" użytej jako listy metod dla funkcji '%s'

source: S language method selection did not return normally when called from internal dispatch for function '%s'
es: La selección del método de S no se devolvió normalmente cuando se llamaba desde el resolución interna del método para la función '%s'
pl: wybór metody języka S nie zwrócił wyniku normalnie podczas wywoływania z wewnętrznego dyspozytora dla funkcji '%s'

source: Function name for method selection called internally
es: Nombre de la función para la selección de métodos llamada internamente
pl: Nazwa funkcji dla wyboru metody wywołana wewnętrznie

source: The "package" slot in generic function object
pl: Gniazdo "package" w obiekcie ogólnej funkcji

source: The argument "f" to getGeneric
pl: Argument "f" przekazany do getGeneric

source: The argument "package" to getGeneric
pl: Argument "package" w wywołaniu getGeneric

source: no generic function definition found for '%s'
es: no se encontró ninguna definición de función genérica para '%s'
pl: nie znaleziono definicji ogólnej funkcji dla '%s'

source: no generic function definition found for '%s' in the supplied environment
es: no se encontró ninguna definición de función genérica para '%s' en el entorno proporcionado
pl: nie znaleziono definicji ogólnej funkcji dla '%s' w dostarczonym środowisku

source: The function name in the call to standardGeneric
pl: Nazwa funkcji w wywołaniu standardGeneric

source: invalid generic function object for method selection for function '%s': expected a function or a primitive, got an object of class "%s"
es: objeto de función genérico no válido para la selección de métodos para la función '%s': se esperaba una función o una primitiva, se obtuvo un objeto de clase "%s"
pl: niepoprawny obiekt ogólnej funkcji dla wyboru metody dla funkcji '%s': oczekiwano funkcji lub typu prymitywnego, otrzymano obiekt klasy '%s'

source: no direct or inherited method for function '%s' for this call
es: no hay ningún método directo o heredado para la función '%s' para esta llamada
pl: brak bezpośredniej lub dziedziczonej metody dla funkcji '%s' dla tego wywołania

source: invalid object (non-function) used as method
es: objeto no válido (no es una función) utilizado como método
pl: niepoprawny obiekt (nie-funkcja) użyty jako metoda

source: 'symbol' must be a SYMSXP
pl: argument 'symbol' musi być symbolem

source: could not find symbol '%s' in frame of call
es: no se pudo encontrar el símbolo '%s' en el entorno de la llamada
pl: nie można było znaleźć symbolu '%s' w strukturze wywołania

source: invalid symbol in checking for missing argument in method dispatch: expected a name, got an object of class "%s"
es: símbolo no válido al chequear el argumento faltante en la resolución del método: se esperaba un nombre, se obtuvo un objeto de clase "%s"
pl: niepoprawny symbol w sprawdzaniu brakującego argumentu w wysyłaniu metody: oczekiwano nazwy, otrzymano obiekt klasy '%s'

source: use of NULL environment is defunct
es: el uso de entorno NULL es obsoleto
pl: użycie środowiska NULL jest przestarzałe

source: invalid environment in checking for missing argument, '%s', in methods dispatch: got an object of class "%s"
es: entorno no válido al chequear el argumento faltante, '%s', en la resolución de métodos: se obtuvo un objeto de clase "%s"
pl: niepoprawne środowisko w sprawdzaniu brakującego argumentu '%s' w wysyłaniu metod: otrzymano obiekt klasy '%s'

source: error in evaluating the argument '%s' in selecting a method for function '%s': %s
es: error al evaluar el argumento '%s' al seleccionar un método para la función '%s': %s
pl: błąd podczas obliczania argumentu '%s' przy wybieraniu metody dla funkcji '%s': %s

source: object of class "%s" used as methods list for function '%s' ( no 'argument' slot)
es: objeto de clase "%s" utilizado como lista de métodos para la función '%s' (sin un slot 'argumento')
pl: obiekt klasy '%s' został użyty jako lista metod dla funkcji '%s' ( brak gniazda 'argument')

source: (in selecting a method for function '%s') '...' and related variables cannot be used for methods dispatch
es: (al seleccionar un método para la función '%s') '...' y las variables relacionadas no se pueden utilizar para la resolución de métodos
pl: (przy wybieraniu metody dla funkcji '%s') '...' oraz powiązane zmienne nie mogą być użyte dla wysyłania metod

source: (in selecting a method for function '%s') the 'environment' argument for dispatch must be an R environment; got an object of class "%s"
es: (al seleccionar un método para la función '%s') el argumento 'environment' para la resolución del método debe ser un entorno R; se obtuvo un objeto de clase "%s"
pl: (przy wybieraniu metody dla funkcji '%s') argument 'environment' dla wysyłania musi być środowiskiem R; otrzymano obiekt klasy '%s'

source: no matching method for function '%s' (argument '%s', with class "%s")
es: no hay método coincidente para la función '%s' (argumento '%s', con la clase "%s")
pl: brak pasującej metody dla funkcji '%s' (argument '%s', z klasą '%s')

source: recursive use of function '%s' in method selection, with no default method
es: uso recursivo de la función '%s' en la selección de métodos, sin método predeterminado
pl: rekursywne użycie funkcji '%s' w wyborze metody, z brakiem określonej metody domyślnej

source: error in evaluating a 'primitive' next method: %s
es: error en la evaluación de un siguiente método 'primitivo': %s
pl: błąd w trakcie obliczania 'primitive' następnej metody: %s

source: internal error in 'callNextMethod': '.nextMethod' was not assigned in the frame of the method call
pl: błąd wewnętrzny w 'callNextMethod': '.nextMethod' nie został przypisany w ramce wywołania metody

source: internal error in 'callNextMethod': '.Generic' was not assigned in the frame of the method call
pl: błąd wewnętrzny w 'callNextMethod': '.Generic' nie został przypisany w ramce wywołania metody

source: %s must be a single string (got a character vector of length %d)
pl: %s musi być pojedynczym ciągiem znaków (otrzymano wektor tekstowy o długości %d)

source: %s must be a non-empty string; got an empty string
pl: %s musi być niepustym ciągiem znaków; otrzymano pusty ciąg

source: %s must be a single string (got an object of class "%s")
pl: %s musi być pojedynczym ciągiem znaków (otrzymano obiekt klasy "%s")

source: The internal prefix (e.g., "C") for a meta-data object
pl: Wewnętrzny prefiks (n.p.: "C") dla obiektu meta-danych

source: The name of the object (e.g,. a class or generic function) to find in the meta-data
pl: Nazwa obiektu (n.p.: kasa lub funkcja ogólna) do znalezienia w meta-danych

source: The name of the package for a meta-data object
pl: Nazwa pakietu dla obiektu meta-danych

source: class should be either a character-string name or a class definition
es: class debe ser un nombre proporcionado como cadena de caracteres o una definición de clase
pl: klasa powinna być albo nazwą tekstową albo definicją klasy

source: failed to get the generic for the primitive "%s"
es: no se pudo obtener el genérico para la primitiva "%s"
pl: nie udało się uzyskać ogólnej funkcji dla typu prymitywnego "%s"

source: expected a generic function or a primitive for dispatch, got an object of class "%s"
es: se esperaba una función genérica o una primitiva para la resolución del método, se obtuvo un objeto de clase "%s"
pl: oczekiwano ogólnej funkcji lub typu prymitywnego dla wysyłania, otrzymano obiekt klasy "%s"

source: generic seems not to have been initialized for table dispatch---need to have '.SigArgs' and '.AllMtable' assigned in its environment
pl: wygląda na to, że funkcja ogólna nie została zainicjowana dla tabeli dyspozytora — w jego środowisku należy przypisać '.SigArgs' oraz '.AllMtable'

source: '.SigArgs' is shorter than '.SigLength' says it should be
pl: '.SigArgs' jest krótsze niż to ile wskazuje '.SigLength'

source: 'R_get_primname' called on a non-primitive
pl: 'R_get_primname' wywołano na funkcji nieprymitywnej
